pupeesh/deauth-test-final/Arduino/hardware/deauther-esp8266/esp8266/2.7.4/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.ESPModule=Module
menu.led=Builtin Led
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=Exceptions
menu.wipe=Erase Flash
menu.sdk=Espressif FW
menu.ssl=SSL Support
menu.deauther_config=Deauther Config

##############################################################
generic.name=Generic ESP8266
generic.build.board=ESP8266_GENERIC
generic.upload.tool=esptool
generic.upload.maximum_data_size=81920
generic.upload.wait_for_upload_port=true
generic.upload.erase_cmd=
generic.serial.disableDTR=true
generic.serial.disableRTS=true
generic.build.mcu=esp8266
generic.build.core=esp8266
generic.build.variant=generic
generic.build.spiffs_pagesize=256
generic.build.debug_port=
generic.build.debug_level=
generic.menu.deauther_config.none=None
generic.menu.deauther_config.nodemcu=NodeMCU
generic.menu.deauther_config.nodemcu.build.config_flags=-DNODEMCU
generic.menu.deauther_config.d1mini=Wemos D1 Mini
generic.menu.deauther_config.d1mini.build.config_flags=-DWEMOS_D1_MINI
generic.menu.deauther_config.example_i2c=Display Example I2C
generic.menu.deauther_config.example_i2c.build.config_flags=-DDISPLAY_EXAMPLE_I2C
generic.menu.deauther_config.example_spi=Display Example SPI
generic.menu.deauther_config.example_spi.build.config_flags=-DDISPLAY_EXAMPLE_SPI
generic.menu.deauther_config.maltronics=Maltronics Deauther
generic.menu.deauther_config.maltronics.build.config_flags=-DMALTRONICS
generic.menu.deauther_config.dstike_deauther_v1=DSTIKE Deauther
generic.menu.deauther_config.dstike_deauther_v1.build.config_flags=-DDSTIKE_DEAUTHER_V1
generic.menu.deauther_config.dstike_deauther_v2=DSTIKE Deauther V2
generic.menu.deauther_config.dstike_deauther_v2.build.config_flags=-DDSTIKE_DEAUTHER_V2
generic.menu.deauther_config.dstike_deauther_v3=DSTIKE Deauther V3
generic.menu.deauther_config.dstike_deauther_v3.build.config_flags=-DDSTIKE_DEAUTHER_V3
generic.menu.deauther_config.dstike_deauther_v3_5=DSTIKE Deauther V3.5
generic.menu.deauther_config.dstike_deauther_v3_5.build.config_flags=-DDSTIKE_DEAUTHER_V3_5
generic.menu.deauther_config.dstike_deauther_led_ring=DSTIKE Deauther d-duino V5 LED Ring
generic.menu.deauther_config.dstike_deauther_led_ring.build.config_flags=-DDSTIKE_D_DUINO_B_V5_LED_RING
generic.menu.deauther_config.dstike_deauther_boy=DSTIKE Deauther Boy
generic.menu.deauther_config.dstike_deauther_boy.build.config_flags=-DDSTIKE_DEAUTHER_BOY
generic.menu.deauther_config.dstike_nodemcu_07=DSTIKE NodeMCU 07
generic.menu.deauther_config.dstike_nodemcu_07.build.config_flags=-DDSTIKE_NODEMCU_07
generic.menu.deauther_config.dstike_nodemcu_07_v2=DSTIKE NodeMCU 07 V2
generic.menu.deauther_config.dstike_nodemcu_07_v2.build.config_flags=-DDSTIKE_NODEMCU_07_V2
generic.menu.deauther_config.dstike_deauther_oled_v1=DSTIKE Deauther OLED
generic.menu.deauther_config.dstike_deauther_oled_v1.build.config_flags=-DDSTIKE_DEAUTHER_OLED
generic.menu.deauther_config.dstike_deauther_oled_v1_5=DSTIKE Deauther OLED V1.5
generic.menu.deauther_config.dstike_deauther_oled_v1_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V1_5
generic.menu.deauther_config.dstike_deauther_oled_v1_5_s=DSTIKE Deauther OLED V1.5S
generic.menu.deauther_config.dstike_deauther_oled_v1_5_s.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V1_5_S
generic.menu.deauther_config.dstike_deauther_oled_v2=DSTIKE Deauther OLED V2
generic.menu.deauther_config.dstike_deauther_oled_v2.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V2
generic.menu.deauther_config.dstike_deauther_oled_v2_5=DSTIKE Deauther OLED V2.5
generic.menu.deauther_config.dstike_deauther_oled_v2_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V2_5
generic.menu.deauther_config.dstike_deauther_oled_v3=DSTIKE Deauther OLED V3
generic.menu.deauther_config.dstike_deauther_oled_v3.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V3
generic.menu.deauther_config.dstike_deauther_oled_v3_5=DSTIKE Deauther OLED V3.5
generic.menu.deauther_config.dstike_deauther_oled_v3_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V3_5
generic.menu.deauther_config.dstike_deauther_oled_v4=DSTIKE Deauther OLED V4
generic.menu.deauther_config.dstike_deauther_oled_v4.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V4
generic.menu.deauther_config.dstike_deauther_oled_v5=DSTIKE Deauther OLED V5
generic.menu.deauther_config.dstike_deauther_oled_v5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V5
generic.menu.deauther_config.dstike_deauther_oled_v6=DSTIKE Deauther OLED V6
generic.menu.deauther_config.dstike_deauther_oled_v6.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V6
generic.menu.deauther_config.dstike_deauther_monster_v1=DSTIKE Deauther Monster
generic.menu.deauther_config.dstike_deauther_monster_v1.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER
generic.menu.deauther_config.dstike_deauther_monster_v2=DSTIKE Deauther Monster V2
generic.menu.deauther_config.dstike_deauther_monster_v2.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V2
generic.menu.deauther_config.dstike_deauther_monster_v3=DSTIKE Deauther Monster V3
generic.menu.deauther_config.dstike_deauther_monster_v3.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V3
generic.menu.deauther_config.dstike_deauther_monster_v4=DSTIKE Deauther Monster V4
generic.menu.deauther_config.dstike_deauther_monster_v4.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V4
generic.menu.deauther_config.dstike_deauther_monster_v5=DSTIKE Deauther Monster V5
generic.menu.deauther_config.dstike_deauther_monster_v5.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V5
generic.menu.deauther_config.dstike_usb_deauther_v1=DSTIKE USB Deauther
generic.menu.deauther_config.dstike_usb_deauther_v1.build.config_flags=-DDSTIKE_USB_DEAUTHER
generic.menu.deauther_config.dstike_usb_deauther_v2=DSTIKE USB Deauther V2
generic.menu.deauther_config.dstike_usb_deauther_v2.build.config_flags=-DDSTIKE_USB_DEAUTHER_V2
generic.menu.deauther_config.dstike_watch_v1=DSTIKE Deauther Watch
generic.menu.deauther_config.dstike_watch_v1.build.config_flags=-DDSTIKE_DEAUTHER_WATCH
generic.menu.deauther_config.dstike_watch_v2=DSTIKE Deauther Watch V2
generic.menu.deauther_config.dstike_watch_v2.build.config_flags=-DDSTIKE_DEAUTHER_WATCH_V2
generic.menu.deauther_config.dstike_mini=DSTIKE Deauther Mini
generic.menu.deauther_config.dstike_mini.build.config_flags=-DDSTIKE_DEAUTHER_MINI
generic.menu.deauther_config.dstike_mini_evo=DSTIKE Deauther Mini EVO
generic.menu.deauther_config.dstike_mini_evo.build.config_flags=-DDSTIKE_DEAUTHER_MINI_EVO
generic.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
generic.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
generic.menu.ResetMethod.ck=no dtr (aka ck)
generic.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
generic.menu.ResetMethod.nodtr_nosync=no dtr, no_sync
generic.menu.ResetMethod.nodtr_nosync.upload.resetmethod=--before no_reset_no_sync --after soft_reset
generic.menu.CrystalFreq.26=26 MHz
generic.menu.CrystalFreq.40=40 MHz
generic.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
generic.menu.FlashFreq.40=40MHz
generic.menu.FlashFreq.40.build.flash_freq=40
generic.menu.FlashFreq.80=80MHz
generic.menu.FlashFreq.80.build.flash_freq=80
generic.menu.FlashFreq.20=20MHz
generic.menu.FlashFreq.20.build.flash_freq=20
generic.menu.FlashFreq.26=26MHz
generic.menu.FlashFreq.26.build.flash_freq=26
generic.menu.FlashMode.dout=DOUT (compatible)
generic.menu.FlashMode.dout.build.flash_mode=dout
generic.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
generic.menu.FlashMode.dio=DIO
generic.menu.FlashMode.dio.build.flash_mode=dio
generic.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
generic.menu.FlashMode.qout=QOUT
generic.menu.FlashMode.qout.build.flash_mode=qout
generic.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
generic.menu.FlashMode.qio=QIO (fast)
generic.menu.FlashMode.qio.build.flash_mode=qio
generic.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
generic.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
generic.menu.eesz.1M64.build.flash_size=1M
generic.menu.eesz.1M64.build.flash_size_bytes=0x100000
generic.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
generic.menu.eesz.1M64.build.spiffs_pagesize=256
generic.menu.eesz.1M64.upload.maximum_size=958448
generic.menu.eesz.1M64.build.rfcal_addr=0xFC000
generic.menu.eesz.1M64.build.spiffs_start=0xEB000
generic.menu.eesz.1M64.build.spiffs_end=0xFB000
generic.menu.eesz.1M64.build.spiffs_blocksize=4096
generic.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
generic.menu.eesz.1M128.build.flash_size=1M
generic.menu.eesz.1M128.build.flash_size_bytes=0x100000
generic.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
generic.menu.eesz.1M128.build.spiffs_pagesize=256
generic.menu.eesz.1M128.upload.maximum_size=892912
generic.menu.eesz.1M128.build.rfcal_addr=0xFC000
generic.menu.eesz.1M128.build.spiffs_start=0xDB000
generic.menu.eesz.1M128.build.spiffs_end=0xFB000
generic.menu.eesz.1M128.build.spiffs_blocksize=4096
generic.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
generic.menu.eesz.1M144.build.flash_size=1M
generic.menu.eesz.1M144.build.flash_size_bytes=0x100000
generic.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
generic.menu.eesz.1M144.build.spiffs_pagesize=256
generic.menu.eesz.1M144.upload.maximum_size=876528
generic.menu.eesz.1M144.build.rfcal_addr=0xFC000
generic.menu.eesz.1M144.build.spiffs_start=0xD7000
generic.menu.eesz.1M144.build.spiffs_end=0xFB000
generic.menu.eesz.1M144.build.spiffs_blocksize=4096
generic.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
generic.menu.eesz.1M160.build.flash_size=1M
generic.menu.eesz.1M160.build.flash_size_bytes=0x100000
generic.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
generic.menu.eesz.1M160.build.spiffs_pagesize=256
generic.menu.eesz.1M160.upload.maximum_size=860144
generic.menu.eesz.1M160.build.rfcal_addr=0xFC000
generic.menu.eesz.1M160.build.spiffs_start=0xD3000
generic.menu.eesz.1M160.build.spiffs_end=0xFB000
generic.menu.eesz.1M160.build.spiffs_blocksize=4096
generic.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
generic.menu.eesz.1M192.build.flash_size=1M
generic.menu.eesz.1M192.build.flash_size_bytes=0x100000
generic.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
generic.menu.eesz.1M192.build.spiffs_pagesize=256
generic.menu.eesz.1M192.upload.maximum_size=827376
generic.menu.eesz.1M192.build.rfcal_addr=0xFC000
generic.menu.eesz.1M192.build.spiffs_start=0xCB000
generic.menu.eesz.1M192.build.spiffs_end=0xFB000
generic.menu.eesz.1M192.build.spiffs_blocksize=4096
generic.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
generic.menu.eesz.1M256.build.flash_size=1M
generic.menu.eesz.1M256.build.flash_size_bytes=0x100000
generic.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
generic.menu.eesz.1M256.build.spiffs_pagesize=256
generic.menu.eesz.1M256.upload.maximum_size=761840
generic.menu.eesz.1M256.build.rfcal_addr=0xFC000
generic.menu.eesz.1M256.build.spiffs_start=0xBB000
generic.menu.eesz.1M256.build.spiffs_end=0xFB000
generic.menu.eesz.1M256.build.spiffs_blocksize=4096
generic.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
generic.menu.eesz.1M512.build.flash_size=1M
generic.menu.eesz.1M512.build.flash_size_bytes=0x100000
generic.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
generic.menu.eesz.1M512.build.spiffs_pagesize=256
generic.menu.eesz.1M512.upload.maximum_size=499696
generic.menu.eesz.1M512.build.rfcal_addr=0xFC000
generic.menu.eesz.1M512.build.spiffs_start=0x7B000
generic.menu.eesz.1M512.build.spiffs_end=0xFB000
generic.menu.eesz.1M512.build.spiffs_blocksize=8192
generic.menu.eesz.1M=1MB (FS:none OTA:~502KB)
generic.menu.eesz.1M.build.flash_size=1M
generic.menu.eesz.1M.build.flash_size_bytes=0x100000
generic.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
generic.menu.eesz.1M.build.spiffs_pagesize=256
generic.menu.eesz.1M.upload.maximum_size=1023984
generic.menu.eesz.1M.build.rfcal_addr=0xFC000
generic.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
generic.menu.eesz.2M64.build.flash_size=2M
generic.menu.eesz.2M64.build.flash_size_bytes=0x200000
generic.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
generic.menu.eesz.2M64.build.spiffs_pagesize=256
generic.menu.eesz.2M64.upload.maximum_size=1044464
generic.menu.eesz.2M64.build.rfcal_addr=0x1FC000
generic.menu.eesz.2M64.build.spiffs_start=0x1F0000
generic.menu.eesz.2M64.build.spiffs_end=0x1FB000
generic.menu.eesz.2M64.build.spiffs_blocksize=4096
generic.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
generic.menu.eesz.2M128.build.flash_size=2M
generic.menu.eesz.2M128.build.flash_size_bytes=0x200000
generic.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
generic.menu.eesz.2M128.build.spiffs_pagesize=256
generic.menu.eesz.2M128.upload.maximum_size=1044464
generic.menu.eesz.2M128.build.rfcal_addr=0x1FC000
generic.menu.eesz.2M128.build.spiffs_start=0x1E0000
generic.menu.eesz.2M128.build.spiffs_end=0x1FB000
generic.menu.eesz.2M128.build.spiffs_blocksize=4096
generic.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
generic.menu.eesz.2M256.build.flash_size=2M
generic.menu.eesz.2M256.build.flash_size_bytes=0x200000
generic.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
generic.menu.eesz.2M256.build.spiffs_pagesize=256
generic.menu.eesz.2M256.upload.maximum_size=1044464
generic.menu.eesz.2M256.build.rfcal_addr=0x1FC000
generic.menu.eesz.2M256.build.spiffs_start=0x1C0000
generic.menu.eesz.2M256.build.spiffs_end=0x1FB000
generic.menu.eesz.2M256.build.spiffs_blocksize=4096
generic.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
generic.menu.eesz.2M512.build.flash_size=2M
generic.menu.eesz.2M512.build.flash_size_bytes=0x200000
generic.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
generic.menu.eesz.2M512.build.spiffs_pagesize=256
generic.menu.eesz.2M512.upload.maximum_size=1044464
generic.menu.eesz.2M512.build.rfcal_addr=0x1FC000
generic.menu.eesz.2M512.build.spiffs_start=0x180000
generic.menu.eesz.2M512.build.spiffs_end=0x1FA000
generic.menu.eesz.2M512.build.spiffs_blocksize=8192
generic.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
generic.menu.eesz.2M1M.build.flash_size=2M
generic.menu.eesz.2M1M.build.flash_size_bytes=0x200000
generic.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
generic.menu.eesz.2M1M.build.spiffs_pagesize=256
generic.menu.eesz.2M1M.upload.maximum_size=1044464
generic.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
generic.menu.eesz.2M1M.build.spiffs_start=0x100000
generic.menu.eesz.2M1M.build.spiffs_end=0x1FA000
generic.menu.eesz.2M1M.build.spiffs_blocksize=8192
generic.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
generic.menu.eesz.2M.build.flash_size=2M
generic.menu.eesz.2M.build.flash_size_bytes=0x200000
generic.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
generic.menu.eesz.2M.build.spiffs_pagesize=256
generic.menu.eesz.2M.upload.maximum_size=1044464
generic.menu.eesz.2M.build.rfcal_addr=0x1FC000
generic.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
generic.menu.eesz.4M1M.build.flash_size=4M
generic.menu.eesz.4M1M.build.flash_size_bytes=0x400000
generic.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
generic.menu.eesz.4M1M.build.spiffs_pagesize=256
generic.menu.eesz.4M1M.upload.maximum_size=1044464
generic.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
generic.menu.eesz.4M1M.build.spiffs_start=0x300000
generic.menu.eesz.4M1M.build.spiffs_end=0x3FA000
generic.menu.eesz.4M1M.build.spiffs_blocksize=8192
generic.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
generic.menu.eesz.4M2M.build.flash_size=4M
generic.menu.eesz.4M2M.build.flash_size_bytes=0x400000
generic.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
generic.menu.eesz.4M2M.build.spiffs_pagesize=256
generic.menu.eesz.4M2M.upload.maximum_size=1044464
generic.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
generic.menu.eesz.4M2M.build.spiffs_start=0x200000
generic.menu.eesz.4M2M.build.spiffs_end=0x3FA000
generic.menu.eesz.4M2M.build.spiffs_blocksize=8192
generic.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
generic.menu.eesz.4M3M.build.flash_size=4M
generic.menu.eesz.4M3M.build.flash_size_bytes=0x400000
generic.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
generic.menu.eesz.4M3M.build.spiffs_pagesize=256
generic.menu.eesz.4M3M.upload.maximum_size=1044464
generic.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
generic.menu.eesz.4M3M.build.spiffs_start=0x100000
generic.menu.eesz.4M3M.build.spiffs_end=0x3FA000
generic.menu.eesz.4M3M.build.spiffs_blocksize=8192
generic.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
generic.menu.eesz.4M.build.flash_size=4M
generic.menu.eesz.4M.build.flash_size_bytes=0x400000
generic.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
generic.menu.eesz.4M.build.spiffs_pagesize=256
generic.menu.eesz.4M.upload.maximum_size=1044464
generic.menu.eesz.4M.build.rfcal_addr=0x3FC000
generic.menu.eesz.8M6M=8MB (FS:6MB OTA:~1019KB)
generic.menu.eesz.8M6M.build.flash_size=8M
generic.menu.eesz.8M6M.build.flash_size_bytes=0x800000
generic.menu.eesz.8M6M.build.flash_ld=eagle.flash.8m6m.ld
generic.menu.eesz.8M6M.build.spiffs_pagesize=256
generic.menu.eesz.8M6M.upload.maximum_size=1044464
generic.menu.eesz.8M6M.build.rfcal_addr=0x7FC000
generic.menu.eesz.8M6M.build.spiffs_start=0x200000
generic.menu.eesz.8M6M.build.spiffs_end=0x7FA000
generic.menu.eesz.8M6M.build.spiffs_blocksize=8192
generic.menu.eesz.8M7M=8MB (FS:7MB OTA:~512KB)
generic.menu.eesz.8M7M.build.flash_size=8M
generic.menu.eesz.8M7M.build.flash_size_bytes=0x800000
generic.menu.eesz.8M7M.build.flash_ld=eagle.flash.8m7m.ld
generic.menu.eesz.8M7M.build.spiffs_pagesize=256
generic.menu.eesz.8M7M.upload.maximum_size=1044464
generic.menu.eesz.8M7M.build.rfcal_addr=0x7FC000
generic.menu.eesz.8M7M.build.spiffs_start=0x100000
generic.menu.eesz.8M7M.build.spiffs_end=0x7FA000
generic.menu.eesz.8M7M.build.spiffs_blocksize=8192
