pupeesh/deauth-test-final/Arduino/hardware/deauther-esp8266/esp8266/2.7.4/boards.txt
esp8285.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp8285.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.CORE=CORE
esp8285.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
esp8285.menu.lvl.WIFI=WIFI
esp8285.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
esp8285.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
esp8285.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
esp8285.menu.lvl.UPDATER=UPDATER
esp8285.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
esp8285.menu.lvl.OTA=OTA
esp8285.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
esp8285.menu.lvl.OOM=OOM
esp8285.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
esp8285.menu.lvl.MDNS=MDNS
esp8285.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
esp8285.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
esp8285.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
esp8285.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
esp8285.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
esp8285.menu.ip.lm2f=v2 Lower Memory
esp8285.menu.ip.lm2f.build.lwip_include=lwip2/include
esp8285.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
esp8285.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
esp8285.menu.ip.hb2f=v2 Higher Bandwidth
esp8285.menu.ip.hb2f.build.lwip_include=lwip2/include
esp8285.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
esp8285.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
esp8285.menu.ip.lm2n=v2 Lower Memory (no features)
esp8285.menu.ip.lm2n.build.lwip_include=lwip2/include
esp8285.menu.ip.lm2n.build.lwip_lib=-llwip2-536
esp8285.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
esp8285.menu.ip.hb2n=v2 Higher Bandwidth (no features)
esp8285.menu.ip.hb2n.build.lwip_include=lwip2/include
esp8285.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
esp8285.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
esp8285.menu.ip.lm6f=v2 IPv6 Lower Memory
esp8285.menu.ip.lm6f.build.lwip_include=lwip2/include
esp8285.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
esp8285.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
esp8285.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
esp8285.menu.ip.hb6f.build.lwip_include=lwip2/include
esp8285.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
esp8285.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
esp8285.menu.ip.hb1=v1.4 Higher Bandwidth
esp8285.menu.ip.hb1.build.lwip_lib=-llwip_gcc
esp8285.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
esp8285.menu.ip.src=v1.4 Compile from source
esp8285.menu.ip.src.build.lwip_lib=-llwip_src
esp8285.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
esp8285.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
esp8285.menu.wipe.none=Only Sketch
esp8285.menu.wipe.none.upload.erase_cmd=
esp8285.menu.wipe.sdk=Sketch + WiFi Settings
esp8285.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
esp8285.menu.wipe.all=All Flash Contents
esp8285.menu.wipe.all.upload.erase_cmd=erase_flash
esp8285.menu.baud.115200=115200
esp8285.menu.baud.115200.upload.speed=115200
esp8285.menu.baud.57600=57600
esp8285.menu.baud.57600.upload.speed=57600
esp8285.menu.baud.230400.linux=230400
esp8285.menu.baud.230400.macosx=230400
esp8285.menu.baud.230400.upload.speed=230400
esp8285.menu.baud.256000.windows=256000
esp8285.menu.baud.256000.upload.speed=256000
esp8285.menu.baud.460800.linux=460800
esp8285.menu.baud.460800.macosx=460800
esp8285.menu.baud.460800.upload.speed=460800
esp8285.menu.baud.512000.windows=512000
esp8285.menu.baud.512000.upload.speed=512000
esp8285.menu.baud.921600=921600
esp8285.menu.baud.921600.upload.speed=921600
esp8285.menu.baud.3000000=3000000
esp8285.menu.baud.3000000.upload.speed=3000000

##############################################################
huzzah.name=Adafruit Feather HUZZAH
huzzah.build.board=ESP8266_ESP12
huzzah.build.variant=adafruit
huzzah.upload.tool=esptool
huzzah.upload.maximum_data_size=81920
huzzah.upload.wait_for_upload_port=true
huzzah.upload.erase_cmd=
huzzah.serial.disableDTR=true
huzzah.serial.disableRTS=true
huzzah.build.mcu=esp8266
huzzah.build.core=esp8266
huzzah.build.spiffs_pagesize=256
huzzah.build.debug_port=
huzzah.build.debug_level=
huzzah.menu.deauther_config.none=None
huzzah.menu.deauther_config.nodemcu=NodeMCU
huzzah.menu.deauther_config.nodemcu.build.config_flags=-DNODEMCU
huzzah.menu.deauther_config.d1mini=Wemos D1 Mini
huzzah.menu.deauther_config.d1mini.build.config_flags=-DWEMOS_D1_MINI
huzzah.menu.deauther_config.example_i2c=Display Example I2C
huzzah.menu.deauther_config.example_i2c.build.config_flags=-DDISPLAY_EXAMPLE_I2C
huzzah.menu.deauther_config.example_spi=Display Example SPI
huzzah.menu.deauther_config.example_spi.build.config_flags=-DDISPLAY_EXAMPLE_SPI
huzzah.menu.deauther_config.maltronics=Maltronics Deauther
huzzah.menu.deauther_config.maltronics.build.config_flags=-DMALTRONICS
huzzah.menu.deauther_config.dstike_deauther_v1=DSTIKE Deauther
huzzah.menu.deauther_config.dstike_deauther_v1.build.config_flags=-DDSTIKE_DEAUTHER_V1
huzzah.menu.deauther_config.dstike_deauther_v2=DSTIKE Deauther V2
huzzah.menu.deauther_config.dstike_deauther_v2.build.config_flags=-DDSTIKE_DEAUTHER_V2
huzzah.menu.deauther_config.dstike_deauther_v3=DSTIKE Deauther V3
huzzah.menu.deauther_config.dstike_deauther_v3.build.config_flags=-DDSTIKE_DEAUTHER_V3
huzzah.menu.deauther_config.dstike_deauther_v3_5=DSTIKE Deauther V3.5
huzzah.menu.deauther_config.dstike_deauther_v3_5.build.config_flags=-DDSTIKE_DEAUTHER_V3_5
huzzah.menu.deauther_config.dstike_deauther_led_ring=DSTIKE Deauther d-duino V5 LED Ring
huzzah.menu.deauther_config.dstike_deauther_led_ring.build.config_flags=-DDSTIKE_D_DUINO_B_V5_LED_RING
huzzah.menu.deauther_config.dstike_deauther_boy=DSTIKE Deauther Boy
huzzah.menu.deauther_config.dstike_deauther_boy.build.config_flags=-DDSTIKE_DEAUTHER_BOY
huzzah.menu.deauther_config.dstike_nodemcu_07=DSTIKE NodeMCU 07
huzzah.menu.deauther_config.dstike_nodemcu_07.build.config_flags=-DDSTIKE_NODEMCU_07
huzzah.menu.deauther_config.dstike_nodemcu_07_v2=DSTIKE NodeMCU 07 V2
huzzah.menu.deauther_config.dstike_nodemcu_07_v2.build.config_flags=-DDSTIKE_NODEMCU_07_V2
huzzah.menu.deauther_config.dstike_deauther_oled_v1=DSTIKE Deauther OLED
huzzah.menu.deauther_config.dstike_deauther_oled_v1.build.config_flags=-DDSTIKE_DEAUTHER_OLED
huzzah.menu.deauther_config.dstike_deauther_oled_v1_5=DSTIKE Deauther OLED V1.5
huzzah.menu.deauther_config.dstike_deauther_oled_v1_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V1_5
huzzah.menu.deauther_config.dstike_deauther_oled_v1_5_s=DSTIKE Deauther OLED V1.5S
huzzah.menu.deauther_config.dstike_deauther_oled_v1_5_s.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V1_5_S
huzzah.menu.deauther_config.dstike_deauther_oled_v2=DSTIKE Deauther OLED V2
huzzah.menu.deauther_config.dstike_deauther_oled_v2.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V2
huzzah.menu.deauther_config.dstike_deauther_oled_v2_5=DSTIKE Deauther OLED V2.5
huzzah.menu.deauther_config.dstike_deauther_oled_v2_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V2_5
huzzah.menu.deauther_config.dstike_deauther_oled_v3=DSTIKE Deauther OLED V3
huzzah.menu.deauther_config.dstike_deauther_oled_v3.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V3
huzzah.menu.deauther_config.dstike_deauther_oled_v3_5=DSTIKE Deauther OLED V3.5
huzzah.menu.deauther_config.dstike_deauther_oled_v3_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V3_5
huzzah.menu.deauther_config.dstike_deauther_oled_v4=DSTIKE Deauther OLED V4
huzzah.menu.deauther_config.dstike_deauther_oled_v4.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V4
huzzah.menu.deauther_config.dstike_deauther_oled_v5=DSTIKE Deauther OLED V5
huzzah.menu.deauther_config.dstike_deauther_oled_v5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V5
huzzah.menu.deauther_config.dstike_deauther_oled_v6=DSTIKE Deauther OLED V6
huzzah.menu.deauther_config.dstike_deauther_oled_v6.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V6
huzzah.menu.deauther_config.dstike_deauther_monster_v1=DSTIKE Deauther Monster
huzzah.menu.deauther_config.dstike_deauther_monster_v1.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER
huzzah.menu.deauther_config.dstike_deauther_monster_v2=DSTIKE Deauther Monster V2
huzzah.menu.deauther_config.dstike_deauther_monster_v2.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V2
huzzah.menu.deauther_config.dstike_deauther_monster_v3=DSTIKE Deauther Monster V3
huzzah.menu.deauther_config.dstike_deauther_monster_v3.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V3
huzzah.menu.deauther_config.dstike_deauther_monster_v4=DSTIKE Deauther Monster V4
huzzah.menu.deauther_config.dstike_deauther_monster_v4.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V4
huzzah.menu.deauther_config.dstike_deauther_monster_v5=DSTIKE Deauther Monster V5
huzzah.menu.deauther_config.dstike_deauther_monster_v5.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V5
huzzah.menu.deauther_config.dstike_usb_deauther_v1=DSTIKE USB Deauther
huzzah.menu.deauther_config.dstike_usb_deauther_v1.build.config_flags=-DDSTIKE_USB_DEAUTHER
huzzah.menu.deauther_config.dstike_usb_deauther_v2=DSTIKE USB Deauther V2
huzzah.menu.deauther_config.dstike_usb_deauther_v2.build.config_flags=-DDSTIKE_USB_DEAUTHER_V2
huzzah.menu.deauther_config.dstike_watch_v1=DSTIKE Deauther Watch
huzzah.menu.deauther_config.dstike_watch_v1.build.config_flags=-DDSTIKE_DEAUTHER_WATCH
huzzah.menu.deauther_config.dstike_watch_v2=DSTIKE Deauther Watch V2
huzzah.menu.deauther_config.dstike_watch_v2.build.config_flags=-DDSTIKE_DEAUTHER_WATCH_V2
huzzah.menu.deauther_config.dstike_mini=DSTIKE Deauther Mini
huzzah.menu.deauther_config.dstike_mini.build.config_flags=-DDSTIKE_DEAUTHER_MINI
huzzah.menu.deauther_config.dstike_mini_evo=DSTIKE Deauther Mini EVO
huzzah.menu.deauther_config.dstike_mini_evo.build.config_flags=-DDSTIKE_DEAUTHER_MINI_EVO
huzzah.upload.resetmethod=--before default_reset --after hard_reset
huzzah.build.flash_mode=qio
huzzah.build.flash_flags=-DFLASHMODE_QIO
huzzah.build.flash_freq=40
huzzah.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
huzzah.menu.eesz.4M1M.build.flash_size=4M
huzzah.menu.eesz.4M1M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
huzzah.menu.eesz.4M1M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M1M.upload.maximum_size=1044464
huzzah.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M1M.build.spiffs_start=0x300000
huzzah.menu.eesz.4M1M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M1M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
huzzah.menu.eesz.4M2M.build.flash_size=4M
huzzah.menu.eesz.4M2M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
huzzah.menu.eesz.4M2M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M2M.upload.maximum_size=1044464
huzzah.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M2M.build.spiffs_start=0x200000
huzzah.menu.eesz.4M2M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M2M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
huzzah.menu.eesz.4M3M.build.flash_size=4M
huzzah.menu.eesz.4M3M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
huzzah.menu.eesz.4M3M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M3M.upload.maximum_size=1044464
huzzah.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
huzzah.menu.eesz.4M3M.build.spiffs_start=0x100000
huzzah.menu.eesz.4M3M.build.spiffs_end=0x3FA000
huzzah.menu.eesz.4M3M.build.spiffs_blocksize=8192
huzzah.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
huzzah.menu.eesz.4M.build.flash_size=4M
huzzah.menu.eesz.4M.build.flash_size_bytes=0x400000
huzzah.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
huzzah.menu.eesz.4M.build.spiffs_pagesize=256
huzzah.menu.eesz.4M.upload.maximum_size=1044464
huzzah.menu.eesz.4M.build.rfcal_addr=0x3FC000
huzzah.build.f_cpu=160000000L
huzzah.build.vtable_flags=-DVTABLES_IN_FLASH
huzzah.build.exception_flags=-fno-exceptions
huzzah.build.sslflags=
huzzah.build.debug_port=
huzzah.build.lwip_include=lwip2/include
huzzah.build.lwip_lib=-llwip2-536-feat
huzzah.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
huzzah.menu.wipe.none=Only Sketch
huzzah.menu.wipe.none.upload.erase_cmd=
huzzah.menu.wipe.sdk=Sketch + WiFi Settings
huzzah.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
huzzah.menu.wipe.all=All Flash Contents
huzzah.menu.wipe.all.upload.erase_cmd=erase_flash
huzzah.menu.baud.115200=115200
huzzah.menu.baud.115200.upload.speed=115200
huzzah.menu.baud.57600=57600
huzzah.menu.baud.57600.upload.speed=57600
huzzah.menu.baud.230400.linux=230400
huzzah.menu.baud.230400.macosx=230400
huzzah.menu.baud.230400.upload.speed=230400
huzzah.menu.baud.256000.windows=256000
huzzah.menu.baud.256000.upload.speed=256000
huzzah.menu.baud.460800.linux=460800
huzzah.menu.baud.460800.macosx=460800
huzzah.menu.baud.460800.upload.speed=460800
huzzah.menu.baud.512000.windows=512000
huzzah.menu.baud.512000.upload.speed=512000
huzzah.menu.baud.921600=921600
huzzah.menu.baud.921600.upload.speed=921600
huzzah.menu.baud.3000000=3000000
huzzah.menu.baud.3000000.upload.speed=3000000

