pupeesh/deauth-test-final/Arduino/hardware/deauther-esp8266/esp8266/2.7.4/boards.txt
##############################################################
maltronics_deauther.name=Maltronics Deauther
maltronics_deauther.build.board=ESP8266_MALTRONICS
maltronics_deauther.build.variant=maltronics
maltronics_deauther.upload.tool=esptool
maltronics_deauther.upload.maximum_data_size=81920
maltronics_deauther.upload.wait_for_upload_port=true
maltronics_deauther.upload.erase_cmd=
maltronics_deauther.serial.disableDTR=true
maltronics_deauther.serial.disableRTS=true
maltronics_deauther.build.mcu=esp8266
maltronics_deauther.build.core=esp8266
maltronics_deauther.build.spiffs_pagesize=256
maltronics_deauther.build.debug_port=
maltronics_deauther.build.debug_level=
maltronics_deauther.build.config_flags=-DMALTRONICS
maltronics_deauther.upload.resetmethod=--before default_reset --after hard_reset
maltronics_deauther.build.flash_mode=dio
maltronics_deauther.build.flash_flags=-DFLASHMODE_DIO
maltronics_deauther.build.flash_freq=40
maltronics_deauther.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
maltronics_deauther.menu.eesz.4M1M.build.flash_size=4M
maltronics_deauther.menu.eesz.4M1M.build.flash_size_bytes=0x400000
maltronics_deauther.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
maltronics_deauther.menu.eesz.4M1M.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.4M1M.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
maltronics_deauther.menu.eesz.4M1M.build.spiffs_start=0x300000
maltronics_deauther.menu.eesz.4M1M.build.spiffs_end=0x3FA000
maltronics_deauther.menu.eesz.4M1M.build.spiffs_blocksize=8192
maltronics_deauther.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
maltronics_deauther.menu.eesz.4M2M.build.flash_size=4M
maltronics_deauther.menu.eesz.4M2M.build.flash_size_bytes=0x400000
maltronics_deauther.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
maltronics_deauther.menu.eesz.4M2M.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.4M2M.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
maltronics_deauther.menu.eesz.4M2M.build.spiffs_start=0x200000
maltronics_deauther.menu.eesz.4M2M.build.spiffs_end=0x3FA000
maltronics_deauther.menu.eesz.4M2M.build.spiffs_blocksize=8192
maltronics_deauther.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
maltronics_deauther.menu.eesz.4M3M.build.flash_size=4M
maltronics_deauther.menu.eesz.4M3M.build.flash_size_bytes=0x400000
maltronics_deauther.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
maltronics_deauther.menu.eesz.4M3M.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.4M3M.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
maltronics_deauther.menu.eesz.4M3M.build.spiffs_start=0x100000
maltronics_deauther.menu.eesz.4M3M.build.spiffs_end=0x3FA000
maltronics_deauther.menu.eesz.4M3M.build.spiffs_blocksize=8192
maltronics_deauther.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
maltronics_deauther.menu.eesz.4M.build.flash_size=4M
maltronics_deauther.menu.eesz.4M.build.flash_size_bytes=0x400000
maltronics_deauther.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
maltronics_deauther.menu.eesz.4M.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.4M.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.4M.build.rfcal_addr=0x3FC000
maltronics_deauther.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
maltronics_deauther.menu.eesz.2M64.build.flash_size=2M
maltronics_deauther.menu.eesz.2M64.build.flash_size_bytes=0x200000
maltronics_deauther.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
maltronics_deauther.menu.eesz.2M64.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.2M64.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.2M64.build.rfcal_addr=0x1FC000
maltronics_deauther.menu.eesz.2M64.build.spiffs_start=0x1F0000
maltronics_deauther.menu.eesz.2M64.build.spiffs_end=0x1FB000
maltronics_deauther.menu.eesz.2M64.build.spiffs_blocksize=4096
maltronics_deauther.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
maltronics_deauther.menu.eesz.2M128.build.flash_size=2M
maltronics_deauther.menu.eesz.2M128.build.flash_size_bytes=0x200000
maltronics_deauther.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
maltronics_deauther.menu.eesz.2M128.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.2M128.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.2M128.build.rfcal_addr=0x1FC000
maltronics_deauther.menu.eesz.2M128.build.spiffs_start=0x1E0000
maltronics_deauther.menu.eesz.2M128.build.spiffs_end=0x1FB000
maltronics_deauther.menu.eesz.2M128.build.spiffs_blocksize=4096
maltronics_deauther.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
maltronics_deauther.menu.eesz.2M256.build.flash_size=2M
maltronics_deauther.menu.eesz.2M256.build.flash_size_bytes=0x200000
maltronics_deauther.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
maltronics_deauther.menu.eesz.2M256.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.2M256.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.2M256.build.rfcal_addr=0x1FC000
maltronics_deauther.menu.eesz.2M256.build.spiffs_start=0x1C0000
maltronics_deauther.menu.eesz.2M256.build.spiffs_end=0x1FB000
maltronics_deauther.menu.eesz.2M256.build.spiffs_blocksize=4096
maltronics_deauther.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
maltronics_deauther.menu.eesz.2M512.build.flash_size=2M
maltronics_deauther.menu.eesz.2M512.build.flash_size_bytes=0x200000
maltronics_deauther.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
maltronics_deauther.menu.eesz.2M512.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.2M512.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.2M512.build.rfcal_addr=0x1FC000
maltronics_deauther.menu.eesz.2M512.build.spiffs_start=0x180000
maltronics_deauther.menu.eesz.2M512.build.spiffs_end=0x1FA000
maltronics_deauther.menu.eesz.2M512.build.spiffs_blocksize=8192
maltronics_deauther.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
maltronics_deauther.menu.eesz.2M1M.build.flash_size=2M
maltronics_deauther.menu.eesz.2M1M.build.flash_size_bytes=0x200000
maltronics_deauther.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
maltronics_deauther.menu.eesz.2M1M.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.2M1M.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
maltronics_deauther.menu.eesz.2M1M.build.spiffs_start=0x100000
maltronics_deauther.menu.eesz.2M1M.build.spiffs_end=0x1FA000
maltronics_deauther.menu.eesz.2M1M.build.spiffs_blocksize=8192
maltronics_deauther.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
maltronics_deauther.menu.eesz.2M.build.flash_size=2M
maltronics_deauther.menu.eesz.2M.build.flash_size_bytes=0x200000
maltronics_deauther.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
maltronics_deauther.menu.eesz.2M.build.spiffs_pagesize=256
maltronics_deauther.menu.eesz.2M.upload.maximum_size=1044464
maltronics_deauther.menu.eesz.2M.build.rfcal_addr=0x1FC000
maltronics_deauther.build.f_cpu=160000000L
maltronics_deauther.build.vtable_flags=-DVTABLES_IN_FLASH
maltronics_deauther.build.exception_flags=-fno-exceptions
maltronics_deauther.build.sslflags=
maltronics_deauther.build.debug_port=
maltronics_deauther.build.lwip_include=lwip2/include
maltronics_deauther.build.lwip_lib=-llwip2-536-feat
maltronics_deauther.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
maltronics_deauther.menu.wipe.none=Only Sketch
maltronics_deauther.menu.wipe.none.upload.erase_cmd=
maltronics_deauther.menu.wipe.sdk=Sketch + WiFi Settings
maltronics_deauther.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
maltronics_deauther.menu.wipe.all=All Flash Contents
maltronics_deauther.menu.wipe.all.upload.erase_cmd=erase_flash
maltronics_deauther.menu.baud.921600=921600
maltronics_deauther.menu.baud.921600.upload.speed=921600
maltronics_deauther.menu.baud.57600=57600
maltronics_deauther.menu.baud.57600.upload.speed=57600
maltronics_deauther.menu.baud.115200=115200
maltronics_deauther.menu.baud.115200.upload.speed=115200
maltronics_deauther.menu.baud.230400.linux=230400
maltronics_deauther.menu.baud.230400.macosx=230400
maltronics_deauther.menu.baud.230400.upload.speed=230400
maltronics_deauther.menu.baud.256000.windows=256000
maltronics_deauther.menu.baud.256000.upload.speed=256000
maltronics_deauther.menu.baud.460800.linux=460800
maltronics_deauther.menu.baud.460800.macosx=460800
maltronics_deauther.menu.baud.460800.upload.speed=460800
maltronics_deauther.menu.baud.512000.windows=512000
maltronics_deauther.menu.baud.512000.upload.speed=512000
maltronics_deauther.menu.baud.3000000=3000000
maltronics_deauther.menu.baud.3000000.upload.speed=3000000

