pupeesh/deauth-test-final/Arduino/hardware/deauther-esp8266/esp8266/2.7.4/boards.txt
##############################################################
dstike_deauther.name=DSTIKE Deauther
dstike_deauther.build.board=ESP8266_DSTIKE
dstike_deauther.build.variant=dstike
dstike_deauther.upload.tool=esptool
dstike_deauther.upload.maximum_data_size=81920
dstike_deauther.upload.wait_for_upload_port=true
dstike_deauther.upload.erase_cmd=
dstike_deauther.serial.disableDTR=true
dstike_deauther.serial.disableRTS=true
dstike_deauther.build.mcu=esp8266
dstike_deauther.build.core=esp8266
dstike_deauther.build.spiffs_pagesize=256
dstike_deauther.build.debug_port=
dstike_deauther.build.debug_level=
dstike_deauther.menu.deauther_config.dstike_deauther_v1=DSTIKE Deauther
dstike_deauther.menu.deauther_config.dstike_deauther_v1.build.config_flags=-DDSTIKE_DEAUTHER_V1
dstike_deauther.menu.deauther_config.dstike_deauther_v2=DSTIKE Deauther V2
dstike_deauther.menu.deauther_config.dstike_deauther_v2.build.config_flags=-DDSTIKE_DEAUTHER_V2
dstike_deauther.menu.deauther_config.dstike_deauther_v3=DSTIKE Deauther V3
dstike_deauther.menu.deauther_config.dstike_deauther_v3.build.config_flags=-DDSTIKE_DEAUTHER_V3
dstike_deauther.menu.deauther_config.dstike_deauther_v3_5=DSTIKE Deauther V3.5
dstike_deauther.menu.deauther_config.dstike_deauther_v3_5.build.config_flags=-DDSTIKE_DEAUTHER_V3_5
dstike_deauther.menu.deauther_config.dstike_deauther_led_ring=DSTIKE Deauther d-duino V5 LED Ring
dstike_deauther.menu.deauther_config.dstike_deauther_led_ring.build.config_flags=-DDSTIKE_D_DUINO_B_V5_LED_RING
dstike_deauther.menu.deauther_config.dstike_deauther_boy=DSTIKE Deauther Boy
dstike_deauther.menu.deauther_config.dstike_deauther_boy.build.config_flags=-DDSTIKE_DEAUTHER_BOY
dstike_deauther.menu.deauther_config.dstike_nodemcu_07=DSTIKE NodeMCU 07
dstike_deauther.menu.deauther_config.dstike_nodemcu_07.build.config_flags=-DDSTIKE_NODEMCU_07
dstike_deauther.menu.deauther_config.dstike_nodemcu_07_v2=DSTIKE NodeMCU 07 V2
dstike_deauther.menu.deauther_config.dstike_nodemcu_07_v2.build.config_flags=-DDSTIKE_NODEMCU_07_V2
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v1=DSTIKE Deauther OLED
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v1.build.config_flags=-DDSTIKE_DEAUTHER_OLED
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v1_5=DSTIKE Deauther OLED V1.5
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v1_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V1_5
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v1_5_s=DSTIKE Deauther OLED V1.5S
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v1_5_s.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V1_5_S
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v2=DSTIKE Deauther OLED V2
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v2.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V2
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v2_5=DSTIKE Deauther OLED V2.5
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v2_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V2_5
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v3=DSTIKE Deauther OLED V3
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v3.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V3
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v3_5=DSTIKE Deauther OLED V3.5
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v3_5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V3_5
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v4=DSTIKE Deauther OLED V4
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v4.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V4
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v5=DSTIKE Deauther OLED V5
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v5.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V5
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v6=DSTIKE Deauther OLED V6
dstike_deauther.menu.deauther_config.dstike_deauther_oled_v6.build.config_flags=-DDSTIKE_DEAUTHER_OLED_V6
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v1=DSTIKE Deauther Monster
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v1.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v2=DSTIKE Deauther Monster V2
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v2.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V2
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v3=DSTIKE Deauther Monster V3
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v3.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V3
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v4=DSTIKE Deauther Monster V4
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v4.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V4
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v5=DSTIKE Deauther Monster V5
dstike_deauther.menu.deauther_config.dstike_deauther_monster_v5.build.config_flags=-DDSTIKE_DEAUTHER_MOSTER_V5
dstike_deauther.menu.deauther_config.dstike_usb_deauther_v1=DSTIKE USB Deauther
dstike_deauther.menu.deauther_config.dstike_usb_deauther_v1.build.config_flags=-DDSTIKE_USB_DEAUTHER
dstike_deauther.menu.deauther_config.dstike_usb_deauther_v2=DSTIKE USB Deauther V2
dstike_deauther.menu.deauther_config.dstike_usb_deauther_v2.build.config_flags=-DDSTIKE_USB_DEAUTHER_V2
dstike_deauther.menu.deauther_config.dstike_watch_v1=DSTIKE Deauther Watch
dstike_deauther.menu.deauther_config.dstike_watch_v1.build.config_flags=-DDSTIKE_DEAUTHER_WATCH
dstike_deauther.menu.deauther_config.dstike_watch_v2=DSTIKE Deauther Watch V2
dstike_deauther.menu.deauther_config.dstike_watch_v2.build.config_flags=-DDSTIKE_DEAUTHER_WATCH_V2
dstike_deauther.menu.deauther_config.dstike_mini=DSTIKE Deauther Mini
dstike_deauther.menu.deauther_config.dstike_mini.build.config_flags=-DDSTIKE_DEAUTHER_MINI
dstike_deauther.menu.deauther_config.dstike_mini_evo=DSTIKE Deauther Mini EVO
dstike_deauther.menu.deauther_config.dstike_mini_evo.build.config_flags=-DDSTIKE_DEAUTHER_MINI_EVO
dstike_deauther.upload.resetmethod=--before default_reset --after hard_reset
dstike_deauther.build.flash_mode=dio
dstike_deauther.build.flash_flags=-DFLASHMODE_DIO
dstike_deauther.build.flash_freq=40
dstike_deauther.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
dstike_deauther.menu.eesz.4M1M.build.flash_size=4M
dstike_deauther.menu.eesz.4M1M.build.flash_size_bytes=0x400000
dstike_deauther.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
dstike_deauther.menu.eesz.4M1M.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.4M1M.upload.maximum_size=1044464
dstike_deauther.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
dstike_deauther.menu.eesz.4M1M.build.spiffs_start=0x300000
dstike_deauther.menu.eesz.4M1M.build.spiffs_end=0x3FA000
dstike_deauther.menu.eesz.4M1M.build.spiffs_blocksize=8192
dstike_deauther.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
dstike_deauther.menu.eesz.4M2M.build.flash_size=4M
dstike_deauther.menu.eesz.4M2M.build.flash_size_bytes=0x400000
dstike_deauther.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
dstike_deauther.menu.eesz.4M2M.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.4M2M.upload.maximum_size=1044464
dstike_deauther.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
dstike_deauther.menu.eesz.4M2M.build.spiffs_start=0x200000
dstike_deauther.menu.eesz.4M2M.build.spiffs_end=0x3FA000
dstike_deauther.menu.eesz.4M2M.build.spiffs_blocksize=8192
dstike_deauther.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
dstike_deauther.menu.eesz.4M3M.build.flash_size=4M
dstike_deauther.menu.eesz.4M3M.build.flash_size_bytes=0x400000
dstike_deauther.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
dstike_deauther.menu.eesz.4M3M.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.4M3M.upload.maximum_size=1044464
dstike_deauther.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
dstike_deauther.menu.eesz.4M3M.build.spiffs_start=0x100000
dstike_deauther.menu.eesz.4M3M.build.spiffs_end=0x3FA000
dstike_deauther.menu.eesz.4M3M.build.spiffs_blocksize=8192
dstike_deauther.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
dstike_deauther.menu.eesz.4M.build.flash_size=4M
dstike_deauther.menu.eesz.4M.build.flash_size_bytes=0x400000
dstike_deauther.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
dstike_deauther.menu.eesz.4M.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.4M.upload.maximum_size=1044464
dstike_deauther.menu.eesz.4M.build.rfcal_addr=0x3FC000
dstike_deauther.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
dstike_deauther.menu.eesz.2M64.build.flash_size=2M
dstike_deauther.menu.eesz.2M64.build.flash_size_bytes=0x200000
dstike_deauther.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
dstike_deauther.menu.eesz.2M64.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.2M64.upload.maximum_size=1044464
dstike_deauther.menu.eesz.2M64.build.rfcal_addr=0x1FC000
dstike_deauther.menu.eesz.2M64.build.spiffs_start=0x1F0000
dstike_deauther.menu.eesz.2M64.build.spiffs_end=0x1FB000
dstike_deauther.menu.eesz.2M64.build.spiffs_blocksize=4096
dstike_deauther.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
dstike_deauther.menu.eesz.2M128.build.flash_size=2M
dstike_deauther.menu.eesz.2M128.build.flash_size_bytes=0x200000
dstike_deauther.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
dstike_deauther.menu.eesz.2M128.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.2M128.upload.maximum_size=1044464
dstike_deauther.menu.eesz.2M128.build.rfcal_addr=0x1FC000
dstike_deauther.menu.eesz.2M128.build.spiffs_start=0x1E0000
dstike_deauther.menu.eesz.2M128.build.spiffs_end=0x1FB000
dstike_deauther.menu.eesz.2M128.build.spiffs_blocksize=4096
dstike_deauther.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
dstike_deauther.menu.eesz.2M256.build.flash_size=2M
dstike_deauther.menu.eesz.2M256.build.flash_size_bytes=0x200000
dstike_deauther.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
dstike_deauther.menu.eesz.2M256.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.2M256.upload.maximum_size=1044464
dstike_deauther.menu.eesz.2M256.build.rfcal_addr=0x1FC000
dstike_deauther.menu.eesz.2M256.build.spiffs_start=0x1C0000
dstike_deauther.menu.eesz.2M256.build.spiffs_end=0x1FB000
dstike_deauther.menu.eesz.2M256.build.spiffs_blocksize=4096
dstike_deauther.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
dstike_deauther.menu.eesz.2M512.build.flash_size=2M
dstike_deauther.menu.eesz.2M512.build.flash_size_bytes=0x200000
dstike_deauther.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
dstike_deauther.menu.eesz.2M512.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.2M512.upload.maximum_size=1044464
dstike_deauther.menu.eesz.2M512.build.rfcal_addr=0x1FC000
dstike_deauther.menu.eesz.2M512.build.spiffs_start=0x180000
dstike_deauther.menu.eesz.2M512.build.spiffs_end=0x1FA000
dstike_deauther.menu.eesz.2M512.build.spiffs_blocksize=8192
dstike_deauther.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
dstike_deauther.menu.eesz.2M1M.build.flash_size=2M
dstike_deauther.menu.eesz.2M1M.build.flash_size_bytes=0x200000
dstike_deauther.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
dstike_deauther.menu.eesz.2M1M.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.2M1M.upload.maximum_size=1044464
dstike_deauther.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
dstike_deauther.menu.eesz.2M1M.build.spiffs_start=0x100000
dstike_deauther.menu.eesz.2M1M.build.spiffs_end=0x1FA000
dstike_deauther.menu.eesz.2M1M.build.spiffs_blocksize=8192
dstike_deauther.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
dstike_deauther.menu.eesz.2M.build.flash_size=2M
dstike_deauther.menu.eesz.2M.build.flash_size_bytes=0x200000
dstike_deauther.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
dstike_deauther.menu.eesz.2M.build.spiffs_pagesize=256
dstike_deauther.menu.eesz.2M.upload.maximum_size=1044464
dstike_deauther.menu.eesz.2M.build.rfcal_addr=0x1FC000
dstike_deauther.build.f_cpu=160000000L
dstike_deauther.build.vtable_flags=-DVTABLES_IN_FLASH
dstike_deauther.build.exception_flags=-fno-exceptions
dstike_deauther.build.sslflags=
dstike_deauther.build.debug_port=
dstike_deauther.build.lwip_include=lwip2/include
dstike_deauther.build.lwip_lib=-llwip2-536-feat
dstike_deauther.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
dstike_deauther.menu.wipe.none=Only Sketch
dstike_deauther.menu.wipe.none.upload.erase_cmd=
dstike_deauther.menu.wipe.sdk=Sketch + WiFi Settings
dstike_deauther.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
dstike_deauther.menu.wipe.all=All Flash Contents
dstike_deauther.menu.wipe.all.upload.erase_cmd=erase_flash
dstike_deauther.menu.baud.921600=921600
dstike_deauther.menu.baud.921600.upload.speed=921600
dstike_deauther.menu.baud.57600=57600
dstike_deauther.menu.baud.57600.upload.speed=57600
dstike_deauther.menu.baud.115200=115200
dstike_deauther.menu.baud.115200.upload.speed=115200
dstike_deauther.menu.baud.230400.linux=230400
dstike_deauther.menu.baud.230400.macosx=230400
dstike_deauther.menu.baud.230400.upload.speed=230400
dstike_deauther.menu.baud.256000.windows=256000
dstike_deauther.menu.baud.256000.upload.speed=256000
dstike_deauther.menu.baud.460800.linux=460800
dstike_deauther.menu.baud.460800.macosx=460800
dstike_deauther.menu.baud.460800.upload.speed=460800
dstike_deauther.menu.baud.512000.windows=512000
dstike_deauther.menu.baud.512000.upload.speed=512000
dstike_deauther.menu.baud.3000000=3000000
dstike_deauther.menu.baud.3000000.upload.speed=3000000

